In [3]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
df.set_index('Name', inplace=True)

In [4]:
print(df)

         Age         City
Name
Alice     25     New York
Bob       30  Los Angeles
Charlie   35      Chicago

In [6]:
df.loc['Bob',"City"]='Mumbai'

In [7]:
df

         Age      City
Name
Alice     25  New York
Bob       30    Mumbai
Charlie   35   Chicago

In [8]:
df.iat[2,0]=40

In [9]:
df

         Age      City
Name
Alice     25  New York
Bob       30    Mumbai
Charlie   40   Chicago

In [10]:
df.iat[0,0]=28

In [11]:
df

         Age      City
Name
Alice     28  New York
Bob       30    Mumbai
Charlie   40   Chicago

In [12]:
df.iloc[0:2,1]=["Delhi","Pune"]

In [13]:
df

         Age     City
Name
Alice     28    Delhi
Bob       30     Pune
Charlie   40  Chicago

In [14]:
df.iloc[:,0]=50

In [15]:
df

         Age     City
Name
Alice     50    Delhi
Bob       50     Pune
Charlie   50  Chicago